# =============================================================================
# Brewfile — Gabriel's macOS development environment
# =============================================================================
# Install everything: brew bundle --file=~/dotfiles/Brewfile
# Dump current:       brew bundle dump --file=~/Brewfile --force
# =============================================================================

# ---- Taps ----
tap "jesseduffield/lazydocker"
tap "mongodb/brew"

# ---- CLI Tools ----
brew "carapace"           # Multi-shell completion
brew "cloc"               # Count lines of code
brew "codex"              # OpenAI Codex CLI
brew "eza"                # Modern ls replacement
brew "fd"                 # Modern find replacement
brew "ffmpeg"             # Media processing
brew "fzf"                # Fuzzy finder
brew "gh"                 # GitHub CLI
brew "helix"              # Modal text editor
brew "lazygit"            # Git TUI
brew "mongosh"            # MongoDB shell
brew "neovim"             # Text editor
brew "nushell"            # Structured shell
brew "opencode"           # AI coding assistant
brew "python@3.11"        # Python
brew "ripgrep"            # Fast grep
brew "starship"           # Cross-shell prompt
brew "tmux"               # Terminal multiplexer
brew "tree"               # Directory tree viewer
brew "yazi"               # Terminal file manager
brew "zoxide"             # Smart cd
brew "zsh-autosuggestions"

# ---- Tap formulae ----
brew "jesseduffield/lazydocker/lazydocker"
brew "mongodb/brew/mongodb-database-tools"

# ---- Desktop Apps (Casks) ----
cask "betterdisplay"                  # Display management
cask "bruno"                          # API client
cask "fliqlo"                         # Flip clock screensaver
cask "font-geist-mono"                # Geist Mono font
cask "font-jetbrains-mono-nerd-font"  # JetBrains Mono Nerd Font
cask "font-monocraft"                 # Monocraft font
cask "ghostty"                        # Terminal emulator
cask "karabiner-elements"             # Keyboard customizer
cask "keycastr"                       # Keystroke visualizer
cask "raycast"                        # Spotlight replacement
cask "visual-studio-code"             # Code editor
cask "warp"                           # AI terminal

# ---- VS Code Extensions ----
vscode "aaravb.chrome-extension-developer-tools"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "alefragnani.project-manager"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "brandonkirbyson.vscode-animations"
vscode "bruno-api-client.bruno"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "chaitanyashahare.lazygit"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "cs50.vscode-presentation-mode"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hoovercj.vscode-settings-cycler"
vscode "johnpapa.vscode-cloak"
vscode "joshspicer.sharp-solarized"
vscode "kevinrose.vsc-python-indent"
vscode "leetcode.vscode-leetcode"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.min-theme"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-commander"
vscode "ms-vscode.vscode-copilot-data-analysis"
vscode "ms-vscode.vscode-copilot-vision"
vscode "ms-vsliveshare.vsliveshare"
vscode "multicoder.multicoder"
vscode "openai.chatgpt"
vscode "pmndrs.pmndrs"
vscode "pomdtr.excalidraw-editor"
vscode "postman.postman-for-vscode"
vscode "pranaygp.vscode-css-peek"
vscode "qirolab.ctrl-alt-cheat"
vscode "ritwickdey.liveserver"
vscode "snippington.snp-pandas-basic"
vscode "subframe7536.custom-ui-style"
vscode "tal7aouy.theme"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vspacecode.whichkey"
vscode "wmaurer.vscode-jumpy"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zkiwiko.gpc-vscode"
