# =============================================================================
# Brewfile — Gabriel's macOS development environment
# =============================================================================
# Install everything: brew bundle --file=~/dotfiles/Brewfile
# Dump current:       brew bundle dump --file="$HOME/dotfiles/Brewfile" --force
# =============================================================================

# ---- Taps ----
tap "jesseduffield/lazydocker"
tap "mongodb/brew"
tap "nikitabobko/tap"

# ---- CLI Tools ----
brew "aria2" # Download with resuming and segmented downloading
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "carapace" # Multi-shell multi-command argument completer
brew "cloc" # Statistics utility to count lines of code
brew "curl" # Get a file from an HTTP, HTTPS or FTP server
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "ffmpeg" # Play, record, convert, and stream select audio and video codecs
brew "fzf" # Command-line fuzzy finder written in Go
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "grep" # GNU grep, egrep and fgrep
brew "helix" # Post-modern modal text editor
brew "imagemagick" # Tools and libraries to manipulate images in select formats
brew "jq" # Lightweight and flexible command-line JSON processor
brew "kanata" # Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "lazygit" # Simple terminal UI for git commands
brew "mole" # Deep clean and optimize your Mac
brew "mongosh" # MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mpv" # Media player based on MPlayer and mplayer2
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "nushell" # Modern shell for the GitHub era
brew "opencode" # AI coding agent, built for the terminal
brew "poppler" # PDF rendering library (based on the xpdf-3.0 code base)
brew "python@3.11" # Interpreted, interactive, object-oriented programming language
brew "resvg" # SVG rendering tool and library
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "sevenzip" # 7-Zip is a file archiver with a high compression ratio
brew "starship" # Cross-shell prompt for astronauts
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "uv" # Extremely fast Python package installer and resolver, written in Rust
brew "xcodegen" # Generate your Xcode project from a spec file and your folder structure
brew "yazi" # Blazing fast terminal file manager written in Rust, based on async I/O
brew "yt-dlp" # Feature-rich command-line audio/video downloader
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh

# ---- Tap Formulae ----
brew "jesseduffield/lazydocker/lazydocker" # A simple terminal UI for docker, written in Go
brew "mongodb/brew/mongodb-database-tools" # This package contains standard utilities for interacting with MongoDB.

# ---- Desktop Apps (Casks) ----
cask "nikitabobko/tap/aerospace" # AeroSpace is an i3-like tiling window manager for macOS
cask "betterdisplay" # Display management tool
cask "bruno" # Open source IDE for exploring and testing APIs
cask "codex" # OpenAI's coding agent that runs in your terminal
cask "fliqlo" # Flip clock screensaver
cask "font-geist-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monocraft"
cask "font-symbols-only-nerd-font"
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "iina" # Free and open-source media player
cask "keycastr" # Open-source keystroke visualiser
cask "visual-studio-code" # Open-source code editor
cask "warp" # Rust-based terminal

# ---- VS Code Extensions ----
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "daltonmenezes.aura-theme"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotenv.dotenv-vscode"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "helgardrichard.helium-icon-theme"
vscode "hoovercj.vscode-settings-cycler"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "pomdtr.excalidraw-editor"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vspacecode.whichkey"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
